Revit 2026 API

# BuiltInFailuresSlabShapeFailuresSlabShapeFailedNotOnlyLines Property

---

The Floor or Roof or Toposolid may only contain straight lines.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static FailureDefinitionId SlabShapeFailedNotOnlyLines { get; }
```
```vb
Public Shared ReadOnly Property SlabShapeFailedNotOnlyLines As FailureDefinitionId
	Get
```
```cpp
public:
static property FailureDefinitionId^ SlabShapeFailedNotOnlyLines {
	FailureDefinitionId^ get ();
}
```
```fsharp
static member SlabShapeFailedNotOnlyLines : FailureDefinitionId with get
```

#### Property Value

FailureDefinitionId

#### Reference

BuiltInFailuresSlabShapeFailures Class

Autodesk.Revit.DB Namespace